#include "goods.h"

goods::goods(string n, string aNo) : name(n), aptNumber(aNo)
{
/* тут пусто */
}
//---------------------------------------------------------

goods::~goods() // деструктор
{
/* тут тоже пусто */
}

//---------------------------------------------------------
string goods::getAptNumber() //геттер возвращает номер комнаты жильца
{
return aptNumber;
}
//--------------------------------------------------------

string goods::getName() //геттер возвращает имя жильца
{
return name;
}
//---------------------------------------------------------
