#include "tenant.h"

Tenant::Tenant(string n, int aNo) : name(n), aptNumber(aNo)
{
/* тут пусто */
}
//---------------------------------------------------------
Tenant::~Tenant() // деструктор
{
/* тут тоже пусто */
}
//---------------------------------------------------------
int Tenant::getAptNumber() //геттер возвращает номер комнаты жильца
{
return aptNumber;
}
//--------------------------------------------------------
string Tenant::getName() //геттер возвращает имя жильца
{
return name;
}
//---------------------------------------------------------
